app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "my pretty esraa"], ["updated_at", "2020-04-13 20:42:36.173959"], ["id", 1]]
---
    def update
      @article = Article.find(params[:id])

      if @article.update(article_params)