app/controllers/comments_controller.rb

    def edit
      @article = Article.find(params[:article_id])
      @comment = Comment.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def update
      @comment = Comment.find(params[:id])
      @article = Article.find(params[:article_id])
      if @comment.update(comment_params)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "commenter" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["commenter", "yay yay"], ["updated_at", "2020-04-14 20:10:28.968346"], ["id", 1]]